Конфигурация/src/Documents/ОплатаПроживания/ОплатаПроживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПроживания</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоБроням</registerRecords>
  <registerRecords>InformationRegister.БронированиеНомеров</registerRecords>
  <attributes>
    <name>Бронь</name>
    <type>
      <types>DocumentRef.БронированиеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <comment>Сколько заплатил гость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ВзаиморасчетыПоБроням/ВзаиморасчетыПоБроням.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоБроням</name>
  <comment>Учет оплаты номеров</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Бронь</name>
    <type>
      <types>DocumentRef.БронированиеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/InformationRegisters/БронированиеНомеров/БронированиеНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БронированиеНомеров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКонца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатусБрони</name>
    <type>
      <types>EnumRef.СтатусБронирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтменаБрони</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Enums/ВидДвижения/ВидДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДвижения</name>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Enums/СтатусБронирования/СтатусБронирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусБронирования</name>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Оплачено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/ОплатаПроживания/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// 1. Получаем Цену Брони
	ЦенаБрони = Бронь.Цена; 
	Сообщить("Цена брони: " + ЦенаБрони);
	
	// 2. Считаем, сколько УЖЕ оплачено ДРУГИМИ документами
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Взаиморасчеты.Сумма), 0) КАК ОплаченоДругими
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоБроням КАК Взаиморасчеты
		|ГДЕ
		|	Взаиморасчеты.Бронь = &Бронь
		|	И Взаиморасчеты.Регистратор <> &Ссылка";
	
	Запрос.УстановитьПараметр("Бронь", Бронь);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ОплаченоДругими = 0;
	Если Выборка.Следующий() Тогда
		ОплаченоДругими = Выборка.ОплаченоДругими;
	КонецЕсли;
	
	Сообщить("Оплачено другими документами: " + ОплаченоДругими);
	Сообщить("Текущая сумма оплаты: " + СуммаОплаты);
	
	// 3. Проверяем переплату
	Если (ОплаченоДругими + СуммаОплаты) > ЦенаБрони Тогда
		
		ОстатокДолга = ЦенаБрони - ОплаченоДругими;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка! Сумма оплаты превышает остаток долга. Максимально можно внести: " + ОстатокДолга;
		Сообщение.Поле = "СуммаОплаты";
		Сообщение.Сообщить();
		
		Отказ = Истина; 
		Возврат;
		
	КонецЕсли;
	
	Движение = Движения.ВзаиморасчетыПоБроням.Добавить();
	Движение.Период = Дата;
	Движение.Бронь = Бронь;
	Движение.Гость = Гость; 
	Движение.Сумма = СуммаОплаты;
	Движение.Вид = Перечисления.ВидДвижения.Оплата;
	
	Движения.ВзаиморасчетыПоБроням.Записывать = Истина;
	Движения.Записать(); 
	
	// --- 2. Автоматическое изменение статуса Брони ---
	
	Если Бронь.Пустая() Тогда
		Сообщить("ВЫХОД: Бронь пустая");
		Возврат;
	КонецЕсли;
	
	БроньОбъект = Бронь.ПолучитьОбъект();
	
	// Получаем текущий статус из регистра — ищем по регистратору (документу брони)
	ЗапросСтатуса = Новый Запрос;
	ЗапросСтатуса.Текст = 
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |    БронированиеНомеров.СтатусБрони КАК СтатусБрони
	    |ИЗ
	    |    РегистрСведений.БронированиеНомеров КАК БронированиеНомеров
	    |ГДЕ
	    |    БронированиеНомеров.Регистратор = &Бронь";
	
	ЗапросСтатуса.УстановитьПараметр("Бронь", Бронь);
	ВыборкаСтатуса = ЗапросСтатуса.Выполнить().Выбрать();
	
	ТекущийСтатус = Неопределено;
	Если ВыборкаСтатуса.Следующий() Тогда
	    ТекущийСтатус = ВыборкаСтатуса.СтатусБрони;
	КонецЕсли;
	
	Сообщить("Текущий статус из регистра: " + ТекущийСтатус);
	
	// Если отменена — выходим
	Если ТекущийСтатус = Перечисления.СтатусБронирования.Отменено Тогда
		Сообщить("ВЫХОД: Бронь отменена");
	    Возврат;
	КонецЕсли;
	
	// Считаем, сколько ВСЕГО оплачено по этой брони
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |    ЕСТЬNULL(СУММА(Взаиморасчеты.Сумма), 0) КАК Оплачено
	    |ИЗ
	    |    РегистрНакопления.ВзаиморасчетыПоБроням КАК Взаиморасчеты
	    |ГДЕ
	    |    Взаиморасчеты.Бронь = &Бронь
	    |    И Взаиморасчеты.Вид = &ВидОплата";

	Запрос.УстановитьПараметр("Бронь", Бронь);
	Запрос.УстановитьПараметр("ВидОплата", Перечисления.ВидДвижения.Оплата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаВсегоОплачено = 0;
	Если Выборка.Следующий() Тогда
		СуммаВсегоОплачено = Выборка.Оплачено;
	КонецЕсли;
	
	Сообщить("Всего оплачено: " + СуммаВсегоОплачено);
	
	ПолнаяЦена = БроньОбъект.Цена; 
	Сообщить("Полная цена: " + ПолнаяЦена);
	
	Если ПолнаяЦена = 0 Тогда
		Сообщить("ВЫХОД: Цена = 0");
		Возврат;
	КонецЕсли;
	
	// --- 3. Проверка условия 30% ---
	ПроцентОплаты = (СуммаВсегоОплачено / ПолнаяЦена) * 100;
	Сообщить("Процент оплаты: " + ПроцентОплаты + "%");
	
	Если ПроцентОплаты >= 30 Тогда
		
	    Если ТекущийСтатус = Перечисления.СтатусБронирования.ОжидаетОплаты Тогда
	            
            Движение = Движения.БронированиеНомеров.Добавить();
            Движение.Номер = БроньОбъект.БронируемыйНомер;
            Движение.ДатаНачала = БроньОбъект.ДатаЗаезда;
            Движение.ДатаКонца = БроньОбъект.ДатаВыезда;
            Движение.СтатусБрони = Перечисления.СтатусБронирования.Оплачено;
            Движение.Гость = Гость;
            Движение.Период = Дата;
            
            Движения.БронированиеНомеров.Записывать = Истина;
			
			Сообщить("Движение добавлено — статус Оплачено");
	    Иначе
			Сообщить("Статус НЕ ОжидаетОплаты, а: " + ТекущийСтатус);
	    КонецЕсли;
	Иначе
		Сообщить("Процент < 30%, не хватает для оплаты");
	КонецЕсли;

КонецПроцедуры
